
class Protein:
    # Словарь, содержащий массы аминокислот
    def __init__(self):
        self.masses = {
            'A': 89.048, 'C': 121.020, 'D': 133.038, 'E': 147.053,
            'F': 165.079, 'G': 75.032, 'H': 155.069, 'I': 131.095,
            'K': 146.106, 'L': 131.095, 'M': 149.051, 'N': 132.053,
            'P': 115.063,  'Q': 146.069, 'R': 174.112, 'S': 105.043,
            'T': 119.058, 'V': 117.079,  'W': 204.090, 'Y': 181.074
            }
        # Масса одной молекулы воды (H2O)
        self.water_mass = 18.01056

    
    def calculate_mass(self, sequence):
        # Вычисляем сумму масс всех аминокислот в последовательности
        sequence_mass = sum(self.masses[aa] for aa in sequence)
        # Вычитаем массу воды за каждую связь между аминокислотами
        sequence_mass -= len(sequence) * self.water_mass 
        # Добавляем одну молекулу воды в конец цепочки
        sequence_mass += self.water_mass
        # Возвращаем итоговую массу  
        return sequence_mass
    
    def get_sequence(self):
        # Ограничиваем длину вводимой последовательности до менее чем 1000 символов
        while True:
            sequence = input("Введите последовательность аминокислот (не более 1000 символов): ")
            # Проверяем длину введённого текста
            if len(sequence) < 1000: 
                # Если длина допустима, возвращаем последовательность
                return sequence  
            else:
                print("Ошибка: последовательность слишком длинная! Введите не более 1000 символов.")


    def get_sequence_mass(self):
        # Получаем последовательность с ограничением длины
        sequence = self.get_sequence()
        try:
            # Вызываем метод для расчёта массы последовательности
            mass = self.calculate_mass(sequence)
            # Выводим результат с точностью до трёх знаков после запятой
            print(f"Масса протеина: {mass:.3f}")
        except KeyError:
            # Выводим сообщение об ошибке, если в последовательности есть недопустимые символы
            print("Ошибка! Введены недопустимые символы.")
    


calculator = Protein()
calculator.get_sequence_mass()

